In [43]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [44]:
# Turn your project folder path into a string 
path = r'C:\Users\carol\Documents\DA\Data Inmersion\04 Python Fundamentals for Data Analysts\Instacart Basket Analysis'

In [45]:
# Import products.csv
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [46]:
# Import orders_wrangled.csv
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [47]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [48]:
# Create a dataframe
df_test = pd.DataFrame()

In [49]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [50]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [51]:
# Check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [52]:
# Convert to string
df_test['mix'] = df_test['mix'].astype('str')

In [53]:
# Check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

In [54]:
# Find missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [55]:
# Create dataframe with null values
df_nan = df_prods[df_prods['product_name'].isnull()==True]

In [56]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [57]:
# Replace missing values with the mean
# df['column with missings'].fillna(mean value, inplace=True)

In [58]:
# Replace missing values with the median
# df['column with missings'].fillna(median value, inplace=True)

In [59]:
# compare the number of rows in your current dataframe with the number in your subset once the missing rows have been remove
df_prods.shape

(49693, 5)

In [60]:
# Create a new dataframe called df_prods_clean
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [61]:
# run df_prods_clean.shape again to check that the number of rows has decreased
df_prods_clean.shape

(49677, 5)

In [62]:
# Another way to drop all missing values
# df_prods.dropna(inplace = True)
# Drops values from a particular column
# df_prods.dropna(subset = [‘product_name’], inplace = True)

In [63]:
# look for full duplicates within the dataframe
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [64]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [65]:
df_prods_clean.shape

(49677, 5)

In [66]:
# create a new dataframe that doesn’t include the duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [67]:
df_prods_clean_no_dups.shape

(49672, 5)

# Task 4.5

## 2.a Run the df.describe() function on your df_ords dataframe

In [68]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## 2.b  Is there anything about the data looks off or should be investigated further?

### Looking at min and max values for all columns, the data looks ok:
#### Day of the week goes from 0 to 6, and percentile 50 is 3
#### Hour of day goes from 0 to 23
#### Days since last order has no negative values

## 3. Check for mixed-type data in your df_ords dataframe.

In [69]:
# Check for mixed types
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

### There's no mixed-type data in the df_ords dataframe

## 5. Run a check for missing values in your df_ords dataframe.

In [70]:
# Find missing values
df_ords.isnull().sum()

Unnamed: 0                    0
order_id                      0
user_id                       0
eval_set                      0
order_number                  0
orders_day_of_week            0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

### The null values could be from the first oders registered. I'll create a dataframe with null values to verify this.

In [71]:
# Create dataframe with null values
df_nan_ords = df_ords[df_ords['days_since_last_order'].isnull()==True]

In [72]:
df_nan_ords.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,0,2539329,1,prior,1,2,8,NaN
11,11,2168274,2,prior,1,2,11,NaN
26,26,1374495,3,prior,1,1,14,NaN
39,39,3343014,4,prior,1,6,11,NaN
45,45,2717275,5,prior,1,3,12,NaN

## 6. Address the missing values using an appropriate method.

### Taking into account that the missing values are from the first order placed by customers, I won't remove or input a new value and will leave the data as is.

## 7. Run a check for duplicate values in your df_ords data.

In [73]:
# look for full duplicates within the dataframe
df_dups_ords = df_ords[df_ords.duplicated()]

In [74]:
df_dups_ords

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, eval_set, order_number, orders_day_of_week, order_hour_of_day, days_since_last_order]
Index: []

### There are no duplicate rows in the df.ords dataframe

## 9. Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder

In [75]:
# Export clean df_prods dataframe
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

In [76]:
# Export clean df_ords dataframe
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))